#### OpenTofu Plan
```
github_repository.this: Preparing import... [id=repo-settings-as-code]
github_repository.this: Refreshing state... [id=repo-settings-as-code]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place (current -> planned)

OpenTofu will perform the following actions:

  # github_repository.this will be updated in-place
  # (imported from "repo-settings-as-code")
  ~ resource "github_repository" "this" {
      ~ allow_auto_merge            = false -> true
        allow_forking               = true
      ~ allow_merge_commit          = true -> false
      ~ allow_rebase_merge          = true -> false
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "Composite action to manage GitHub repository settings with OpenTofu."
        etag                        = "W/\"309edc2ad7e914772032c700cd2df018709b8ae188479d7fceb020578cc79271\""
        fork                        = "false"
        full_name                   = "lens0021/repo-settings-as-code"
        git_clone_url               = "git://github.com/lens0021/repo-settings-as-code.git"
        has_discussions             = false
      - has_downloads               = true -> null
        has_issues                  = true
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
        html_url                    = "https://github.com/lens0021/repo-settings-as-code"
        http_clone_url              = "https://github.com/lens0021/repo-settings-as-code.git"
        id                          = "repo-settings-as-code"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "repo-settings-as-code"
        node_id                     = "R_kgDORblkgg"
        private                     = false
        repo_id                     = 1169777794
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "BLANK"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:lens0021/repo-settings-as-code.git"
        svn_url                     = "https://github.com/lens0021/repo-settings-as-code"
      ~ topics                      = [
          + "github-actions",
          + "opentofu",
        ]
        visibility                  = "public"
        web_commit_signoff_required = false
    }

  # github_repository_ruleset.default will be created
  + resource "github_repository_ruleset" "default" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "default"
      + node_id     = (known after apply)
      + repository  = "repo-settings-as-code"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + deletion                      = true
          + non_fast_forward              = true
          + required_linear_history       = true
          + required_signatures           = false
          + update                        = false
          + update_allows_fetch_and_merge = false

          + pull_request {
              + allowed_merge_methods             = (known after apply)
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }

          + required_status_checks {
              + do_not_enforce_on_create             = false
              + strict_required_status_checks_policy = false

              + required_check {
                  + context        = "biome"
                  + integration_id = 15368
                }
              + required_check {
                  + context        = "lint"
                  + integration_id = 15368
                }
              + required_check {
                  + context        = "rumdl"
                  + integration_id = 15368
                }
              + required_check {
                  + context        = "zizmor"
                  + integration_id = 15368
                }
            }
        }
    }

Plan: 1 to import, 1 to add, 1 to change, 0 to destroy.

Warning: Deprecated attribute

  on repository.tf line 46, in resource "github_repository" "this":
  46:       ignore_vulnerability_alerts_during_read,

The attribute "ignore_vulnerability_alerts_during_read" is deprecated. Refer
to the provider documentation for details.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```
